Tekla Open API Reference for Tekla Structures 2025
Load.LoadAttachment Property
 The load attachment.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Load.LoadAttachmentEnum LoadAttachment { get; set; }
Public Property LoadAttachment As Load.LoadAttachmentEnum
	Get
	Set
Property Value
Type: Load.LoadAttachmentEnum
See Also
Reference
Load Class
Tekla.Structures.Model Namespace